set_property -dict {PACKAGE_PIN E3 IOSTANDARD LVCMOS33} [get_ports clk]
#    create_clock -period 10.000 -name sys_clk_pin -waveform {0.000 5.000} -add [get_ports clk]
create_clock -period 10.000 -name clk -waveform {0.000 5.000} [get_ports clk]

set_property -dict {PACKAGE_PIN V15 IOSTANDARD LVCMOS33} [get_ports {addr[10]}]
set_property -dict {PACKAGE_PIN U16 IOSTANDARD LVCMOS33} [get_ports {addr[9]}]
set_property -dict {PACKAGE_PIN P14 IOSTANDARD LVCMOS33} [get_ports {addr[8]}]
set_property -dict {PACKAGE_PIN T11 IOSTANDARD LVCMOS33} [get_ports {addr[7]}]
set_property -dict {PACKAGE_PIN R12 IOSTANDARD LVCMOS33} [get_ports {addr[6]}]
set_property -dict {PACKAGE_PIN T14 IOSTANDARD LVCMOS33} [get_ports {addr[5]}]
set_property -dict {PACKAGE_PIN T15 IOSTANDARD LVCMOS33} [get_ports {addr[4]}]
set_property -dict {PACKAGE_PIN T16 IOSTANDARD LVCMOS33} [get_ports {addr[3]}]
set_property -dict {PACKAGE_PIN N15 IOSTANDARD LVCMOS33} [get_ports {addr[2]}]
set_property -dict {PACKAGE_PIN M16 IOSTANDARD LVCMOS33} [get_ports {addr[1]}]
set_property -dict {PACKAGE_PIN V17 IOSTANDARD LVCMOS33} [get_ports {addr[0]}]

set_property -dict {PACKAGE_PIN U11 IOSTANDARD LVCMOS33} [get_ports {data[7]}]
set_property -dict {PACKAGE_PIN V16 IOSTANDARD LVCMOS33} [get_ports {data[6]}]
set_property -dict {PACKAGE_PIN M13 IOSTANDARD LVCMOS33} [get_ports {data[5]}]
set_property -dict {PACKAGE_PIN R10 IOSTANDARD LVCMOS33} [get_ports {data[4]}]
set_property -dict {PACKAGE_PIN R11 IOSTANDARD LVCMOS33} [get_ports {data[3]}]
set_property -dict {PACKAGE_PIN R13 IOSTANDARD LVCMOS33} [get_ports {data[2]}]
set_property -dict {PACKAGE_PIN R15 IOSTANDARD LVCMOS33} [get_ports {data[1]}]
set_property -dict {PACKAGE_PIN P15 IOSTANDARD LVCMOS33} [get_ports {data[0]}]

set_property -dict {PACKAGE_PIN R16 IOSTANDARD LVCMOS33} [get_ports {deviceControl[7]}]
set_property -dict {PACKAGE_PIN N16 IOSTANDARD LVCMOS33} [get_ports {deviceControl[6]}]
set_property -dict {PACKAGE_PIN N14 IOSTANDARD LVCMOS33} [get_ports {deviceControl[5]}]
set_property -dict {PACKAGE_PIN U17 IOSTANDARD LVCMOS33} [get_ports {deviceControl[4]}]
set_property -dict {PACKAGE_PIN T18 IOSTANDARD LVCMOS33} [get_ports {deviceControl[3]}]
set_property -dict {PACKAGE_PIN R18 IOSTANDARD LVCMOS33} [get_ports {deviceControl[2]}]
set_property -dict {PACKAGE_PIN P18 IOSTANDARD LVCMOS33} [get_ports {deviceControl[1]}]
set_property -dict {PACKAGE_PIN N17 IOSTANDARD LVCMOS33} [get_ports {deviceControl[0]}]

set_property -dict {PACKAGE_PIN F5 IOSTANDARD LVCMOS33} [get_ports {deviceSelect[3]}]
set_property -dict {PACKAGE_PIN D8 IOSTANDARD LVCMOS33} [get_ports {deviceSelect[2]}]
set_property -dict {PACKAGE_PIN C7 IOSTANDARD LVCMOS33} [get_ports {deviceSelect[1]}]
set_property -dict {PACKAGE_PIN E7 IOSTANDARD LVCMOS33} [get_ports {deviceSelect[0]}]
set_property -dict {PACKAGE_PIN D7 IOSTANDARD LVCMOS33} [get_ports rw]
set_property -dict {PACKAGE_PIN D5 IOSTANDARD LVCMOS33} [get_ports int_ack]

set_property -dict {PACKAGE_PIN U18 IOSTANDARD LVCMOS33} [get_ports nirq]
set_property -dict {PACKAGE_PIN R17 IOSTANDARD LVCMOS33} [get_ports pgm_gate]
set_property -dict {PACKAGE_PIN P17 IOSTANDARD LVCMOS33} [get_ports ext_clock]
set_property -dict {PACKAGE_PIN E1  IOSTANDARD LVCMOS33} [get_ports synth_ext_clock]

# All inputs/bidirectional lines get pullups

set_property PULLUP true [get_ports {deviceControl[0]}]
set_property PULLUP true [get_ports {deviceControl[1]}]
set_property PULLUP true [get_ports {deviceControl[2]}]
set_property PULLUP true [get_ports {deviceControl[3]}]
set_property PULLUP true [get_ports {deviceControl[4]}]
set_property PULLUP true [get_ports {deviceControl[5]}]
set_property PULLUP true [get_ports {deviceControl[6]}]
set_property PULLUP true [get_ports {deviceControl[7]}]

set_property PULLUP true [get_ports {data[0]}]
set_property PULLUP true [get_ports {data[1]}]
set_property PULLUP true [get_ports {data[2]}]
set_property PULLUP true [get_ports {data[3]}]
set_property PULLUP true [get_ports {data[4]}]
set_property PULLUP true [get_ports {data[5]}]
set_property PULLUP true [get_ports {data[6]}]
set_property PULLUP true [get_ports {data[7]}]

set_property PULLUP true [get_ports ext_clock]
set_property PULLUP true [get_ports nirq]

# For now, all outputs get pulldowns

set_property PULLDOWN true [get_ports pgm_gate]
set_property PULLDOWN true [get_ports rw]
set_property PULLDOWN true [get_ports int_ack]
set_property PULLDOWN true [get_ports synth_ext_clock]

# Don't include path from ext_clock and nirq inputs to the sync FFs in timing analysis

set_input_delay -clock clk 1 [get_ports ext_clock]
set_input_delay -clock clk 1 [get_ports nirq]
set_false_path -from [get_ports ext_clock] -through [get_nets {syncExt/di}]
set_false_path -from [get_ports nirq] -through [get_nets {syncIrq/di}]

# Prevent no_output_delay warnings

set_output_delay -clock clk 1 [get_ports pgm_gate]
set_output_delay -clock clk 1 [get_ports rw]
set_output_delay -clock clk 1 [get_ports int_ack]
set_false_path -through [get_ports pgm_gate]
set_false_path -through [get_ports rw]
set_false_path -through [get_ports int_ack]
set_false_path -through [get_ports synth_ext_clock]

set_output_delay -clock clk 1 [get_ports {deviceSelect[3]}]
set_output_delay -clock clk 1 [get_ports {deviceSelect[2]}]
set_output_delay -clock clk 1 [get_ports {deviceSelect[1]}]
set_output_delay -clock clk 1 [get_ports {deviceSelect[0]}]
set_false_path -through [get_ports {deviceSelect[3]}]
set_false_path -through [get_ports {deviceSelect[2]}]
set_false_path -through [get_ports {deviceSelect[1]}]
set_false_path -through [get_ports {deviceSelect[0]}]

set_output_delay -clock clk 1 [get_ports {addr[10]}]
set_output_delay -clock clk 1 [get_ports {addr[9]}]
set_output_delay -clock clk 1 [get_ports {addr[8]}]
set_output_delay -clock clk 1 [get_ports {addr[7]}]
set_output_delay -clock clk 1 [get_ports {addr[6]}]
set_output_delay -clock clk 1 [get_ports {addr[5]}]
set_output_delay -clock clk 1 [get_ports {addr[4]}]
set_output_delay -clock clk 1 [get_ports {addr[3]}]
set_output_delay -clock clk 1 [get_ports {addr[2]}]
set_output_delay -clock clk 1 [get_ports {addr[1]}]
set_output_delay -clock clk 1 [get_ports {addr[0]}]
set_false_path -through [get_ports {addr[10]}]
set_false_path -through [get_ports {addr[9]}]
set_false_path -through [get_ports {addr[8]}]
set_false_path -through [get_ports {addr[7]}]
set_false_path -through [get_ports {addr[6]}]
set_false_path -through [get_ports {addr[5]}]
set_false_path -through [get_ports {addr[4]}]
set_false_path -through [get_ports {addr[3]}]
set_false_path -through [get_ports {addr[2]}]
set_false_path -through [get_ports {addr[1]}]
set_false_path -through [get_ports {addr[0]}]

set_output_delay -clock clk 1 [get_ports {data[7]}]
set_output_delay -clock clk 1 [get_ports {data[6]}]
set_output_delay -clock clk 1 [get_ports {data[5]}]
set_output_delay -clock clk 1 [get_ports {data[4]}]
set_output_delay -clock clk 1 [get_ports {data[3]}]
set_output_delay -clock clk 1 [get_ports {data[2]}]
set_output_delay -clock clk 1 [get_ports {data[1]}]
set_output_delay -clock clk 1 [get_ports {data[0]}]
set_false_path -through [get_ports {data[7]}]
set_false_path -through [get_ports {data[6]}]
set_false_path -through [get_ports {data[5]}]
set_false_path -through [get_ports {data[4]}]
set_false_path -through [get_ports {data[3]}]
set_false_path -through [get_ports {data[2]}]
set_false_path -through [get_ports {data[1]}]
set_false_path -through [get_ports {data[0]}]

set_output_delay -clock clk 1 [get_ports {deviceControl[7]}]
set_output_delay -clock clk 1 [get_ports {deviceControl[6]}]
set_output_delay -clock clk 1 [get_ports {deviceControl[5]}]
set_output_delay -clock clk 1 [get_ports {deviceControl[4]}]
set_output_delay -clock clk 1 [get_ports {deviceControl[3]}]
set_output_delay -clock clk 1 [get_ports {deviceControl[2]}]
set_output_delay -clock clk 1 [get_ports {deviceControl[1]}]
set_output_delay -clock clk 1 [get_ports {deviceControl[0]}]
set_false_path -through [get_ports {deviceControl[7]}]
set_false_path -through [get_ports {deviceControl[6]}]
set_false_path -through [get_ports {deviceControl[5]}]
set_false_path -through [get_ports {deviceControl[4]}]
set_false_path -through [get_ports {deviceControl[3]}]
set_false_path -through [get_ports {deviceControl[2]}]
set_false_path -through [get_ports {deviceControl[1]}]
set_false_path -through [get_ports {deviceControl[0]}]

# Prevent no_input_delay warnings

set_input_delay -clock clk 1 [get_ports {data[7]}]
set_input_delay -clock clk 1 [get_ports {data[6]}]
set_input_delay -clock clk 1 [get_ports {data[5]}]
set_input_delay -clock clk 1 [get_ports {data[4]}]
set_input_delay -clock clk 1 [get_ports {data[3]}]
set_input_delay -clock clk 1 [get_ports {data[2]}]
set_input_delay -clock clk 1 [get_ports {data[1]}]
set_input_delay -clock clk 1 [get_ports {data[0]}]

set_input_delay -clock clk 1 [get_ports {deviceControl[7]}]
set_input_delay -clock clk 1 [get_ports {deviceControl[6]}]
set_input_delay -clock clk 1 [get_ports {deviceControl[5]}]
set_input_delay -clock clk 1 [get_ports {deviceControl[4]}]
set_input_delay -clock clk 1 [get_ports {deviceControl[3]}]
set_input_delay -clock clk 1 [get_ports {deviceControl[2]}]
set_input_delay -clock clk 1 [get_ports {deviceControl[1]}]
set_input_delay -clock clk 1 [get_ports {deviceControl[0]}]

set_property BITSTREAM.GENERAL.COMPRESS TRUE [current_design]

# Config setup
set_property CFGBVS VCCO [current_design]
set_property CONFIG_VOLTAGE 3.3 [current_design]
